public class main {
    public static void main(String[] args){
        /**
         * 权限修饰符
         * public   任意位置都能调用
         * protected    可以在继承中访问，也可以在同包中访问（受保护的修饰符，保护子类，在子类中只能子类去调用）
         * 默认不写     在本类和同包中能访问
         * private： 私有的，只能在本类中访问
         * 1. 修饰符能修饰什么
         * 权限修饰符能修饰类本身，和类中的成员（程序块除外）
         * 权限修饰符用来修饰类的时候只有两个可以用 public 默认不写
         * 权限修饰符都可以用来修饰类中的其他成员
         * 2. 范围如何
         *
         *
         * 特征修饰符
         * 1。可以修饰什么
         * 2。修饰以后有什么特点
         *
         * final 最终的，不可更改的
         * 可以修饰变量  如果在定义变量的时候没有定义初始值，可以给变量一次重新赋值的机会
         * 修饰属性 必须赋值默认值
         * 修饰方法 父类的方法被final修饰，子类不能进行重写
         * 修饰类本身 修饰类，类不能进行继承 太监类
         */
    }
}
